

/* 10Домашнее задание - Циклы */
/*
Дан массив чисел const arr = [1, 40, -5, 10, 0];
Написать функцию, которая сортирует данный массив при помощи циклов.

подсказка:
- нужно использовать 2 цикла, вложенных друг в друга,
- нужно сравнивать и менять элементы */


/* 11 Домашнее задание - Функции высшего порядка */
/* Напишите функцию, которая принимает:
-Массив чисел
-Функцию удаления элементов
И возвращает отфильтрованный массив. При этом функция удаления элементов принимает
число и возвращает true, если его надо удалить и false, если надо оставить */

/* 12 Домашнее задание - Итерации в массивах */
/* Дан массив строк [`10-02-2022`, `тест`, `11/12/2023`, `00/13/2022`, `41/12/2023`]
Необходимо написать функцию, которая бы удаляла бы из массива все строки,
которые нельзя перевести в дату (можно:10-02-2022 11/12/2023)
и возвращала бы новый массив вида:
- [`10-02-2022`, `12-11-2023`] */


/* 13 Домашнее задание - Работа со строками */
/* Написать функцию проверки номера карты алгоритма Луна. 
В функцию передаётся карта 4561-2612-1234-5464. 
а функция возвращает true если акарта проходит алгоритм
 и false если нет */

/* 14 Домашнее задание - Объекты */
/* Написать функцуию которая принимает обхект query параметров и возвращает строку для вставки
{
    search: 'Вася', 
    take: 10,
} 
//search=Вася&take=10
*/

/*15 Домашнее задание - Scope и this */
/* Написать объект ToDoList, который хранит в себе задачи {'title': 'Помыть посуду', id: 1, priority: 1} и имеет методы:
- Добавить задачу
- Удалить задачу по id
- Обновить имя или приоритет по id
- Отсортировать задачи по приоритету
*/

/* 16 Домашнее задание - Управление this */
/* возьмите объект из прошлого задания и 
последовательно примените все методы на его ный объект
const newTask {
    tasks[{
        id: 1,
    name: 'test',
        description: 'описание',
        order: 0,
    }]
} */

/* 17 Домашнее задание - Document Object Model */
/* напишите калькулятор который позволяет ввести 2 числа в 2 инпута
и нажать кнопку оперции сложения деления вычитания умножения
выведите результат в отдельное поле */